----------------------------------------------------------------------------
Mon Sep 16 15:20:35 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 16 월 C++                           월56수34          (3주 1일)
//
// 정렬(sort) 
//  - 두 값을 서로 바꿀 수 있다.
//    그렇다면 데이터를 순서대로 정렬할 수 있다.
//-----------------------------------------------------------------------------

#include <iostream>
#include <algorithm>
#include "save.h"
using namespace std;

int main()
{
	int a[ 10 ] { 10, 8, 6, 4, 2, 9, 7, 5, 3, 1 };

	// [문제] 오름차순으로 a를 정렬하고 출력하자
	sort( begin( a ), end( a ), []( int a, int b ) {	// [] - 람다
		return a < b;
	});
	
	for( int d : a )
		cout << d << ' ';
	cout << endl;

	save( "소스.cpp" );
}
