----------------------------------------------------------------------------
Wed Sep 11 12:19:58 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 11 월 C++                           월56수34          (2주 2일)
//
// 변수 초기화 - uniform initializtion, RAII - 초기화는 자원을 확보할때 일어난다.
// 참조(reference) - 원본 객체의 alias
//-----------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

// [문제] 두 변수의 값을 교환되도록 함수를 선언하고 정의하라

void change( int&, int& );		// 인티저 레퍼런스(reference)

int main()
{	
	int a { 1 };
	int b { 2 };

	// 함수 change를 호출하였다
	change( a, b );

	cout << a << ", " << b << endl;		// 2, 1 이라고 출력

	save( "소스.cpp" );
}

void change( int& p, int& q )
{
	int temp { p };
	p = q;
	q = temp;
}