----------------------------------------------------------------------------
Wed Sep 18 12:51:40 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 18 월 C++                           월56수34          (3주 2일)
//
// 람다
// 알고리즘 sort
//-----------------------------------------------------------------------------

#include <iostream>
#include <algorithm>
#include <random>
#include "save.h"
using namespace std;

// [문제] int 100'000 개를 random 값(1 ~ 1'000'000)으로 설정하라.
// 오름차순으로 정렬하라.
// 제일 큰 값을 찾아 화면에 출력하라.

int main()
{
	int a [ 100'000 ];

	default_random_engine dre;
	uniform_int_distribution<> uni( 1, 1'000'000 );

	for( int& d : a )
		d = uni( dre );

	sort( begin( a ), end( a ) );

	cout << "제일 큰 값 : " << a[100'000-1] << endl;

	save( "소스.cpp" );
}