----------------------------------------------------------------------------
Mon Sep  9 135943 2019
----------------------------------------------------------------------------


-----------------------------------------------------------------------------
 2019. 9. 9 월 C++                           월56수34          (2주 1일)

 C++ IO
 변수
 랜덤 넘버 생성 방법
-----------------------------------------------------------------------------

#include iostream
#include save.h

using namespace std;

int main()
{
	save( 소스.cpp );

	cout  구구단을 출력합니다.  endl;

	while( true )
	{
		int dan;
		cout  몇 단인지 입력해 주세요.  ;
		cin  dan;

		if( dan  1 && dan  10 )
		{
			for( int i = 1; i  10; ++i )
				cout  dan    i  =  ( dani )  endl;
		}
		else
			cout  2~9단 까지만 입력하세요.  endl;
	}

}