----------------------------------------------------------------------------
Mon Sep  9 142029 2019
----------------------------------------------------------------------------


-----------------------------------------------------------------------------
 2019. 9. 9 월 C++                           월56수34          (2주 1일)

 변수
 랜덤 넘버 생성 방법
-----------------------------------------------------------------------------

#include iostream
#include save.h
using namespace std;

int main()
{
	char			c;							 token  의미를 가지는 최소단위
	메모리크기		메모리에 엑세스하는 이름
	int		i;
	float	f;
	double	d;

	c = 1;						 쓰기연산 (assignement)
	cout  static_castint(c)  endl;		 형변환

	save( 소스.cpp );
}