----------------------------------------------------------------------------
Wed Sep 11 11:42:41 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 11 월 C++                           월56수34          (2주 2일)
//
// 랜덤 넘버 생성 방법
//-----------------------------------------------------------------------------

#include <iostream>
#include <random>
#include <thread>
#include "save.h"
using namespace std;

int main()
{	
	save( "소스.cpp" );

	// 주사위 수 생성
	default_random_engine dre;
	uniform_int_distribution<> uid( 1, 6 );

	while( true )
	{
		this_thread::sleep_for( 1s );	// 1초에 한번씩 작동
		cout << uid( dre ) << endl;
	}

}