----------------------------------------------------------------------------
Wed Sep 11 11:54:55 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 11 월 C++                           월56수34          (2주 2일)
//
// 변수 초기화 - uniform initializtion
//-----------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

int main()
{	
	// 초기화란 메모리가 확보될때 설정값을 쓰는 동작이다.
	int a;				// int라는 크기만큼 메모리를 할당한 후 그 메모리에 접근할 때 a라는 이름을 사용하겠다는 선언
	int b = 0;			// 명시적인 초기화
	int c = int( 0 );	// 복사생성(복사초기화)
	int d = b;			// 복사초기화
	int e {};			// uniform initializtion의 디폴트 초기화
	//int f();			// 함수를 선언하는 동작, 초기화 X
	int g { 0 };		// uniform initializtion

	save( "소스.cpp" );
}