----------------------------------------------------------------------------
Mon Sep 16 14:58:52 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 16 월 C++                           월56수34          (3주 1일)
//
// 정렬(sort) 
//  - 두 값을 서로 바꿀 수 있다.
//    그렇다면 데이터를 순서대로 정렬할 수 있다.
//-----------------------------------------------------------------------------

#include <iostream>
#include "save.h"
using namespace std;

// 함수 포인터
int ascend( void*, void* );

int ascend( const void* a, const void* b )	// const - 메모리를 읽기 전용으로 사용
{
	return *( int* ) a - *( int* ) b;
}

int main()
{
	int a[ 10 ] { 10, 8, 6, 4, 2, 9, 7, 5, 3, 1 };

	int( *comp )( const void*, const void* ) = ascend;

	qsort( a, 10, sizeof( int ), comp );	// (자료구조 , 갯수 , 인자의 크기 , 함수의 번지) , ascend는 함수 포인터

	for( int d : a )
		cout << d << ' ';
	cout << endl;

	save( "소스.cpp" );
}