----------------------------------------------------------------------------
Mon Sep 30 14:46:54 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 30 월 C++                           월56수34          (5주 1일)
//
//
// FILE I/O - 자료는 실행되는 프로그램 밖 어디라도 있을 수 있다
//
// 시험 1 - (5주 2일, 10월 2일 수요일)
//-----------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include <random>
#include <iomanip>	// setw 사용
#include "save.h"
using namespace std;

// [문제] "데이터.txt"에 있는 정수 1000개를 읽어라
// 오름차순으로 정렬한 후 화면에 모두 출력하라

int main()
{
	ifstream in { "데이터.txt" };

	int data[ 1000 ];

	for( int i = 0; i < 1000; ++i )
		in >> data[ i ];

	sort( begin( data ), end( data ) );

	for( int d : data )
		cout << setw(10) << d << "\t";
	cout << endl;

	save( "소스.cpp" );
}
