----------------------------------------------------------------------------
Wed Sep  4 13:09:18 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 4 월 C++                           월56수34          (1주 2일)
//
// C++ I/O
//
// 과제 
//	- C++함수 공부하기
//-----------------------------------------------------------------------------

#include <iostream>
#include <string>
#include "save.h"

// C++ 실행파일은 
// cin, cout, cerr, clog 객체를 자동으로 생성한다

int main ()
{
	std::cout << "이름을 알려주세요 : ";
	std::string name;
	std::cin >> name;
	std::cout << "안녕하세요?" << name << "님. 반갑습니다." << std::endl;
	std::cerr << "에러는 이쪽에 저장됩니다." << std::endl;
	std::clog << "로그는 여기로 흘러갑니다." << std::endl;

	save("소스.cpp");
}