----------------------------------------------------------------------------
Mon Sep 16 143639 2019
----------------------------------------------------------------------------


-----------------------------------------------------------------------------
 2019. 9. 16 월 C++                           월56수34          (3주 1일)

 정렬(sort) 
  - 두 값을 서로 바꿀 수 있다.
    그렇다면 데이터를 순서대로 정렬할 수 있다.
-----------------------------------------------------------------------------

#include iostream
#include save.h
using namespace std;

void change( int&, int& );

int main()
{
	int a[ 10 ] { 10, 8, 6, 4, 2, 9, 7, 5, 3, 1 };

	 [문제] a를 오름차순(ascending order)으로 정렬하라

	for( int i { 0 }; i  9; ++i )
	{
		for( int j { 0 }; j  9 - i; ++j )
			if( a[ j ]  a[ j + 1 ] )
				change( a[ j ], a[ j + 1 ] );
		 a를 출력
		for( int d  a )
			cout  d  ' ';
		cout  endl;
	}

	save( 소스.cpp );
}

void change( int& p, int& q )
{
	int temp { p };
	p = q;
	q = temp;
}
