----------------------------------------------------------------------------
Wed Sep 18 12:05:35 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 18 월 C++                           월56수34          (3주 2일)
//
// 람다
// 알고리즘 sort
//-----------------------------------------------------------------------------

#include <iostream>
#include <algorithm>
#include "save.h"
using namespace std;

int main()
{
	// 정수 2개를 받아 합을 리턴하는 람다를 작성하고 인자 (2, 3)으로 호출하여 결과를 화면에 출력하라.

	auto f = [](int a, int b)
	{
		return a + b;
	};

	cout << f( 2, 3 ) << endl;

	cout << [](int a, int b){
			return a + b;
	}( 2, 3 ) << endl;
	
	save( "소스.cpp" );
}