----------------------------------------------------------------------------
Mon Sep 30 14:01:31 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 30 월 C++                           월56수34          (5주 1일)
//
//
// FILE I/O - 자료는 실행되는 프로그램 밖 어디라도 있을 수 있다
//
// 시험 1 - (5주 2일, 10월 2일 수요일)
//-----------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include <random>
#include "save.h"
using namespace std;

// [준비] 정수 1000개를 "데이터.txt"에 기록하자
// 정수의 값은 uid(dre)로 쓴다

int main()
{
	default_random_engine dre;
	uniform_int_distribution<int> uid;

	ofstream out { "데이터.txt" };

	for( int i = 0; i < 1000; ++i )
		out << uid( dre ) << endl;

	save( "소스.cpp" );
}