----------------------------------------------------------------------------
Mon Sep 30 14:59:50 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 30 월 C++                           월56수34          (5주 1일)
//
//
// FILE I/O - 자료는 실행되는 프로그램 밖 어디라도 있을 수 있다
//
// 시험 1 - (5주 2일, 10월 2일 수요일)
//-----------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include "save.h"
using namespace std;

// [문제] "소스.cpp"의 글자 중 영문자를 모두 대문자로 바꿔
// "소스대문자.cpp"로 저장하라

int main()
{
	ifstream in { "소스.cpp" };
	ofstream out { "소스대문자.cpp" };

	char c;
	while( ( c = in.get() ) != EOF )
	{
		if( c > 96 && c < 123 )
			c -= 32;
		out.put( c );
	}
	
	save( "소스.cpp" );
}


----------------------------------------------------------------------------
Mon Sep 30 15:06:04 2019
----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
// 2019. 9. 30 월 C++                           월56수34          (5주 1일)
//
//
// FILE I/O - 자료는 실행되는 프로그램 밖 어디라도 있을 수 있다
//
// 시험 1 - (5주 2일, 10월 2일 수요일)
//-----------------------------------------------------------------------------

#include <iostream>
#include <fstream>
#include "save.h"
using namespace std;

// [문제] "소스.cpp"의 글자 중 영문자를 모두 대문자로 바꿔
// "소스대문자.cpp"로 저장하라

int main()
{
	ifstream in { "소스.cpp" };
	ofstream out { "소스대문자.cpp" };

	int c;
	while( ( c = in.get() ) != EOF )
	{
		if( isalpha( c ) )			// 영문자 확인
			c = toupper( c );		// 대문자 변환
		out.put( c );				// 기록
	}
	
	save( "소스.cpp" );
}